bzt_siege_test.yml
execution:
- executor: siege
  concurrency: 200
  iterations: 5
  scenario: simplest

scenarios: 
  simplest:
    requests:
    - https://www.webperformance.com/
    - https://www.webperformance.com/load-testing-tools/blog/
    - https://www.webperformance.com/load-testing-consulting-services/
    - https://www.webperformance.com/support/